Revit 2026 API
DWFImportOptions Class
 The import options used by importing DWF or DWFx format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DWFImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class DWFImportOptions : IDisposable
Public Class DWFImportOptions
	Implements IDisposable
public ref class DWFImportOptions : IDisposable
type DWFImportOptions =
    class
        interface IDisposable
    end
The DWFImportOptions type exposes the following members.
Constructors
Name | Description
DWFImportOptions(DWFImportOptions) |  Constructs a new instance of DWFImportOptions as a copy of the import options.
DWFImportOptions(IList<ElementId>) | Initializes a new instance of the DWFImportOptions class
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DWFImportOptions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSheetViews |  Get sheet views where DWF markups are imported.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetSheetViews
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace